app/Controllers/UserController.php

    public function login()
    {
        $data = [];

        if ($this->request->getMethod() == 'post') {


                $model = new UserModel();
                $user = $model->where('system_name', $this->request->getVar('username'))
                    ->first();
                if ($user) {
                    if($user['role_id'] == 1){
                        $user_status = 'employee';
                    }elseif($user['role_id'] == 2){
                        $user_status = 'admin';
                    }else{
                        $user_status = 'none';
                    }
                $permission_tb = new Permission();
                // get all permission
                $permission = $permission_tb->where('user_status', $user_status)->findAll();
---
SELECT *
FROM `permission`
WHERE `user_status` = 'admin'